In [1]:
#Import Pacakages
import pandas as pd

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [2]:
# Specify the path to your CSV file
csv_file = "employees.csv"

# Read the CSV file into a DataFrame
df_employees = pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_employees

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991
...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,10/28/1988
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988
300022,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987

In [44]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_employees.shape
num_rows

(300024, 7)

In [45]:
# Check for null values in the specified column
has_null_values = df_employees.isna().any()
has_null_values

emp_no          False
emp_title_id    False
birth_date      False
first_name      False
last_name       False
sex             False
hire_date       False
dtype: bool

In [3]:
df_employees.dtypes

emp_no           int64
emp_title_id    object
birth_date      object
first_name      object
last_name       object
sex             object
hire_date       object
dtype: object

In [26]:
# Find duplicates in the "Employee ID" column
duplicates = df_employees[df_employees.duplicated(subset=['emp_title_id'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
        emp_no emp_title_id  birth_date   first_name  last_name sex  \
0       473302        s0001   7/25/1953     Hideyuki   Zallocco   M
1       475053        e0002  11/18/1954        Byong  Delgrande   F
2        57444        e0002   1/30/1958        Berry       Babb   F
3       421786        s0001   9/28/1957        Xiong   Verhoeff   M
4       282238        e0003  10/28/1952   Abdelkader    Baumann   F
...        ...          ...         ...          ...        ...  ..
300019  464231        s0001   8/14/1958  Constantino    Eastman   M
300020  255832        e0002    5/8/1955       Yuping     Dayang   F
300021   76671        s0001    6/9/1959       Ortrud   Plessier   M
300022  264920        s0001   9/22/1959        Percy   Samarati   F
300023  464503        s0002   5/31/1964       Arvind  Slobodova   M

         hire_date
0        4/28/1990
1         9/7/1991
2        3/21/1992
3       11/26/1987
4        1/18/1991
...            ...
300019  10/28/1988
300020   2/26/1995
300021   2/24/1988
300022    9/8/1994
300023  11/23/1987

[300024 rows x 7 columns]

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_employees['emp_no'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_title_id" column to strings and calculate the maximum length
max_emp_no_length = df_employees['emp_title_id'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "birth_date" column to strings and calculate the maximum length
max_emp_no_length = df_employees['birth_date'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "first_name" column to strings and calculate the maximum length
max_emp_no_length = df_employees['first_name'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "last_name" column to strings and calculate the maximum length
max_emp_no_length = df_employees['last_name'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "sex" column to strings and calculate the maximum length
max_emp_no_length = df_employees['sex'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "hire_date" column to strings and calculate the maximum length
max_emp_no_length = df_employees['hire_date'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Find duplicates in the "Employee ID" column
duplicates = df_employees[df_employees.duplicated(subset=['emp_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

In [27]:
# Specify the path to your CSV file
csv_file = "titles.csv"

# Read the CSV file into a DataFrame
df_titles = pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_titles

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [43]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_titles.shape
num_rows

(7, 2)

In [42]:
# Check for null values in the specified column
has_null_values = df_titles.isna().any()
has_null_values

title_id    False
title       False
dtype: bool

In [8]:
df_titles.dtypes

title_id    object
title       object
dtype: object

In [10]:
# Find duplicates in the "Employee ID" column
duplicates = df_titles[df_titles.duplicated(subset=['title'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
Empty DataFrame
Columns: [title_id, title]
Index: []

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_titles['title_id'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_titles['title'].astype(str).str.len().max()
max_emp_no_length

In [46]:
# Specify the path to your CSV file
csv_file = "departments.csv"

# Read the CSV file into a DataFrame
df_departments = pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_departments

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [47]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_departments.shape
num_rows

(9, 2)

In [48]:
# Check for null values in the specified column
has_null_values =df_departments.isna().any()
has_null_values

dept_no      False
dept_name    False
dtype: bool

In [12]:
df_departments.dtypes

dept_no      object
dept_name    object
dtype: object

In [13]:
# Find duplicates in the "Employee ID" column
duplicates = df_departments[df_departments.duplicated(subset=['dept_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
Empty DataFrame
Columns: [dept_no, dept_name]
Index: []

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_departments['dept_no'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_departments['dept_name'].astype(str).str.len().max()
max_emp_no_length

In [14]:
# Specify the path to your CSV file
csv_file = "salaries.csv"

# Read the CSV file into a DataFrame
df_salaries = pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [49]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_salaries.shape
num_rows

(300024, 2)

In [51]:
# Check for null values in the specified column
has_null_values =df_salaries.isna().any()
has_null_values

emp_no    False
salary    False
dtype: bool

In [ ]:
df_salaries.dtypes

In [56]:
# Find duplicates in the "Employee ID" column
duplicates = df_salaries[df_salaries.duplicated(subset=['emp_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
Empty DataFrame
Columns: [emp_no, salary]
Index: []

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_salaries['emp_no'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_salaries['salary'].astype(str).str.len().max()
max_emp_no_length

In [17]:
# Specify the path to your CSV file
csv_file = "dept_emp.csv"

# Read the CSV file into a DataFrame
df_dept_emp = pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_dept_emp

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [54]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_dept_emp.shape
num_rows

(331603, 2)

In [55]:
# Check for null values in the specified column
has_null_values =df_dept_emp.isna().any()
has_null_values

emp_no     False
dept_no    False
dtype: bool

In [18]:
df_dept_emp.dtypes

emp_no      int64
dept_no    object
dtype: object

In [34]:
# Find duplicates in the "Employee ID" column
duplicates = df_dept_emp[df_dept_emp.duplicated(subset=['dept_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [57]:
# Find duplicates in the "Employee ID" column
duplicates = df_dept_emp[df_dept_emp.duplicated(subset=['emp_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
        emp_no dept_no
9        10010    d004
10       10010    d006
18       10018    d004
19       10018    d005
30       10029    d004
...        ...     ...
331576  499975    d003
331584  499983    d004
331585  499983    d009
331594  499992    d001
331595  499992    d003

[63158 rows x 2 columns]

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_dept_emp['emp_no'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_dept_emp['dept_no'].astype(str).str.len().max()
max_emp_no_length

In [28]:
# Specify the path to your CSV file
csv_file = "dept_manager.csv"

# Read the CSV file into a DataFrame
df_dept_manager= pd.read_csv(csv_file)

# Now you can work with the data using pandas methods
df_dept_manager

   dept_no  emp_no
0     d001  110022
1     d001  110039
2     d002  110085
3     d002  110114
4     d003  110183
5     d003  110228
6     d004  110303
7     d004  110344
8     d004  110386
9     d004  110420
10    d005  110511
11    d005  110567
12    d006  110725
13    d006  110765
14    d006  110800
15    d006  110854
16    d007  111035
17    d007  111133
18    d008  111400
19    d008  111534
20    d009  111692
21    d009  111784
22    d009  111877
23    d009  111939

In [62]:
# num_rows will contain the number of rows in the DataFrame.
num_rows = df_dept_manager.shape
num_rows

(24, 2)

In [58]:
# Check for null values in the specified column
has_null_values =df_dept_manager.isna().any()
has_null_values

dept_no    False
emp_no     False
dtype: bool

In [61]:
# Find duplicates in the "Employee ID" column
duplicates = df_dept_manager[df_dept_manager.duplicated(subset=['emp_no'], keep=False)]

# Print the rows with duplicates in the "Employee ID" column
print("Duplicates in 'Employee ID' column:")
print(duplicates)

Duplicates in 'Employee ID' column:
Empty DataFrame
Columns: [dept_no, emp_no]
Index: []

In [22]:
df_dept_manager.dtypes

dept_no    object
emp_no      int64
dtype: object

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_dept_manager['dept_no'].astype(str).str.len().max()
max_emp_no_length

In [ ]:
# Convert the "emp_no" column to strings and calculate the maximum length
max_emp_no_length = df_dept_manager['emp_no'].astype(str).str.len().max()
max_emp_no_length